""""
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.

Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали
одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем
Петя и Сережа вместе?

Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.
"""

n = 60

n1 = n // 6 # Нахождим результат Пети
n2 = n // 6*4 # Нахождим результат Кати
n3 = n // 6 # Нахождим результат Сережи
print(n1, n2, n3)
